In [2]:
# Import the libraries
import pandas as pd
import numpy as np

In [3]:
# Load the data
df = pd.read_csv(r"C:\Users\ASUS\OneDrive\Data Analytic Projects\USA Real Estate Dataset.csv", low_memory=False)

In [4]:
df.shape

(1048575, 15)

In [5]:
# Look at the data
df.head(5)

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,103378.0,for_sale,105000.0,3.0,2.0,0.12,1962661.0,Adjuntas,Puerto Rico,601.0,920.0,NaN,NaN,NaN,NaN
1,52707.0,for_sale,80000.0,4.0,2.0,0.08,1902874.0,Adjuntas,Puerto Rico,601.0,1527.0,NaN,NaN,NaN,NaN
2,103379.0,for_sale,67000.0,2.0,1.0,0.15,1404990.0,Juana Diaz,Puerto Rico,795.0,748.0,NaN,NaN,NaN,NaN
3,31239.0,for_sale,145000.0,4.0,2.0,0.10,1947675.0,Ponce,Puerto Rico,731.0,1800.0,NaN,NaN,NaN,NaN
4,34632.0,for_sale,65000.0,6.0,2.0,0.05,331151.0,Mayaguez,Puerto Rico,680.0,NaN,NaN,NaN,NaN,

In [7]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 15 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   brokered_by     1047537 non-null  float64
 1   status          1048575 non-null  object
 2   price           1047485 non-null  float64
 3   bed             738569 non-null   float64
 4   bath            723607 non-null   float64
 5   acre_lot        870247 non-null   float64
 6   street          1041799 non-null  float64
 7   city            1047715 non-null  object
 8   state           1048568 non-null  object
 9   zip_code        1048416 non-null  float64
 10  house_size      683689 non-null   float64
 11  prev_sold_date  497886 non-null   object
 12  Unnamed: 12     0 non-null        float64
 13  Unnamed: 13     0 non-null        float64
 14  Unnamed: 14     1 non-null        object
dtypes: float64(10), object(5)
memory usage: 120.0+ MB

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,Unnamed: 12,Unnamed: 13,Unnamed: 14
count,1.047537e+06,1048575,1.047485e+06,738569.000000,723607.000000,870247.000000,1.041799e+06,1047715,1048568,1.048416e+06,6.836890e+05,497886,0.0,0.0,1
unique,NaN,2,NaN,NaN,NaN,NaN,NaN,15973,47,NaN,NaN,13847,NaN,NaN,1
top,NaN,for_sale,NaN,NaN,NaN,NaN,NaN,Chicago,Florida,NaN,NaN,4/29/2022,NaN,NaN,
freq,NaN,1031598,NaN,NaN,NaN,NaN,NaN,12688,163840,NaN,NaN,2042,NaN,NaN,1
mean,5.187727e+04,NaN,4.774979e+05,3.309546,2.536147,15.345766,1.055064e+06,NaN,NaN,3.790441e+04,2.137796e+03,NaN,NaN,NaN,NaN
std,3.039121e+04,NaN,2.774217e+06,1.598269,1.675857,747.421182,6.057396e+05,NaN,NaN,1.965920e+04,1.249966e+04,NaN,NaN,NaN,NaN
min,0.000000e+00,NaN,0.000000e+00,1.000000,1.000000,0.000000,3.000000e+00,NaN,NaN,0.000000e+00,4.000000e+00,NaN,NaN,NaN,NaN
25%,2.371300e+04,NaN,1.200000e+05,3.000000,2.000000,0.180000,5.309800e+05,NaN,NaN,2.500500e+04,1.312000e+03,NaN,NaN,NaN,NaN
50%,5.263300e+04,NaN,2.760000e+05,3.000000,2.000000,0.360000,1.064730e+06,NaN,NaN,3.395000e+04,1.800000e+03,NaN,NaN,NaN,NaN
75%,7.883800e+04,NaN,4.820000e+05,4.000000,3.000000,1.300000,1.599512e+06,NaN,NaN,5.322200e+04,2.500000e+03,NaN,NaN,NaN,NaN
max,1.101420e+05,NaN,2.147484e+09,473.000000,752.000000,100000.000000,2.001357e+06,NaN,NaN,9.999900e+04,9.842382e+06,NaN,NaN,NaN,NaN

In [5]:
# Standardize column names
df.columns = (
    df.columns
      .str.strip()
      .str.lower()
      .str.replace(' ', '_')
      .str.replace('-', '_'))

In [6]:
# Drop useless unnamed columns
df.drop(['unnamed:_12', 'unnamed:_13', 'unnamed:_14'], axis=1, inplace=True)

In [7]:
#check duplicates
df.duplicated().sum()

np.int64(0)

In [8]:
df.dtypes

brokered_by       float64
status             object
price             float64
bed               float64
bath              float64
acre_lot          float64
street            float64
city               object
state              object
zip_code          float64
house_size        float64
prev_sold_date     object
dtype: object

In [9]:
# Strip & standardize strings
object_cols = df.select_dtypes(include="object").columns
df[object_cols] = df[object_cols].apply(lambda x: x.astype("string").str.strip())

In [10]:
# Convert numeric columns properly
numeric_cols = ["price", "bed", "bath", "acre_lot", "house_size"]

for col in numeric_cols:
    df[col] = pd.to_numeric(df[col])

In [11]:
int_cols = ["price", "bed", "bath", "house_size"]

for col in int_cols:
    df[col] = df[col].round().astype("Int64")

In [12]:
# Handle ID-like columns
df["brokered_by"] = df["brokered_by"].astype("Int64")
df["street"] = df["street"].astype("Int64")
df["zip_code"] = df["zip_code"].astype("Int64")

In [13]:
df["prev_sold_date"] = pd.to_datetime(
    df["prev_sold_date"]
)

In [14]:
#check missing values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 12 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   brokered_by     1047537 non-null  Int64
 1   status          1048575 non-null  string
 2   price           1047485 non-null  Int64
 3   bed             738569 non-null   Int64
 4   bath            723607 non-null   Int64
 5   acre_lot        870247 non-null   float64
 6   street          1041799 non-null  Int64
 7   city            1047715 non-null  string
 8   state           1048568 non-null  string
 9   zip_code        1048416 non-null  Int64
 10  house_size      683689 non-null   Int64
 11  prev_sold_date  497886 non-null   datetime64[ns]
dtypes: Int64(7), datetime64[ns](1), float64(1), string(3)
memory usage: 103.0 MB

In [15]:
#Identify critical columns
critical_cols = ["price", "state", "status"]

#Drop rows with nulls only in these columns
df = df.dropna(subset=critical_cols)

In [16]:
#Columns to impute (replace nulls)
df["bed"] = df["bed"].fillna(df["bed"].median())
df["bath"] = df["bath"].fillna(df["bath"].median())
df["city"] = df["city"].fillna("Unknown")
# Acre & house size: keep NaN (important signal)

In [17]:
int_type_cols = df.select_dtypes(include="int").columns
print(int_type_cols)

# Check for impossible values
print("column : shape")
for col in int_type_cols:
    
    print(f"{col} : {df[df[col] <= 0].shape}")

Index(['brokered_by', 'price', 'bed', 'bath', 'street', 'zip_code',
       'house_size'],
      dtype='object')
column : shape
brokered_by : (3, 12)
price : (121, 12)
bed : (0, 12)
bath : (0, 12)
street : (0, 12)
zip_code : (1, 12)
house_size : (0, 12)

In [18]:
#inspect before dropping invalid brokered_by
df.loc[df["brokered_by"] <= 0, ["brokered_by", "price", "status", "state"]].head(10)

        brokered_by   price    status    state
410969            0  190000  for_sale  Georgia
411599            0  279900  for_sale  Georgia
412072            0  265000  for_sale  Georgia

In [19]:
df.loc[df["brokered_by"] == 0, "brokered_by"] = pd.NA

In [20]:
#inspect before dropping invalid prices
df.loc[df["price"] <= 0, ["price", "status", "state"]].head(10)

        price          status           state
46207       0        for_sale      New Jersey
46208       0        for_sale      New Jersey
49607       0        for_sale        New York
57803       0        for_sale      New Jersey
116304      0        for_sale        New York
286067      0  ready_to_build  North Carolina
286068      0  ready_to_build  North Carolina
286069      0  ready_to_build  North Carolina
286070      0  ready_to_build  North Carolina
286072      0  ready_to_build  North Carolina

In [21]:
df.loc[df["price"] == 0, "price"] = pd.NA

In [22]:
df = df.dropna(subset=["price"])

**Listings with price equal to zero were reclassified as missing prices. These primarily correspond to ‘ready_to_build’ or incomplete listings and were excluded only for price-based analyses.**

In [23]:
df[df["acre_lot"] <= 0].shape

(1009, 12)

In [24]:
df.loc[df["acre_lot"] == 0, "acre_lot"] = pd.NA

In [25]:
df = df.dropna(subset=["house_size"])

In [26]:
# Check null ratio
df.isna().mean().sort_values(ascending=False)
df.isna().sum()

brokered_by          619
status                 0
price                  0
bed                    0
bath                   0
acre_lot          149343
street              4185
city                   0
state                  0
zip_code              49
house_size             0
prev_sold_date    284742
dtype: int64

### Adding new useful columns and information

In [27]:
# Price per Sqft
df["price_per_sqft"] = np.where(
    (df["house_size"].notna()) & (df["house_size"] > 0),
    df["price"] / df["house_size"],
    np.nan
)

In [28]:
#Price trends over time by state
df["prev_sold_year"] = df["prev_sold_date"].dt.year.astype('Int64')

In [29]:
df.info()
df.describe(include="all")

<class 'pandas.core.frame.DataFrame'>
Index: 682986 entries, 0 to 1048573
Data columns (total 14 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   brokered_by     682367 non-null  Int64
 1   status          682986 non-null  string
 2   price           682986 non-null  Int64
 3   bed             682986 non-null  Int64
 4   bath            682986 non-null  Int64
 5   acre_lot        533643 non-null  float64
 6   street          678801 non-null  Int64
 7   city            682986 non-null  string
 8   state           682986 non-null  string
 9   zip_code        682937 non-null  Int64
 10  house_size      682986 non-null  Int64
 11  prev_sold_date  398244 non-null  datetime64[ns]
 12  price_per_sqft  682986 non-null  float64
 13  prev_sold_year  398244 non-null  Int64
dtypes: Int64(8), datetime64[ns](1), float64(2), string(3)
memory usage: 83.4 MB

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,price_per_sqft,prev_sold_year
count,682367.0,682986,682986.0,682986.0,682986.0,533643.000000,678801.0,682986,682986,682937.0,682986.0,398244,6.829860e+05,398244.0
unique,<NA>,2,<NA>,<NA>,<NA>,NaN,<NA>,13856,46,<NA>,<NA>,NaN,NaN,<NA>
top,<NA>,for_sale,<NA>,<NA>,<NA>,NaN,<NA>,Chicago,Florida,<NA>,<NA>,NaN,NaN,<NA>
freq,<NA>,666318,<NA>,<NA>,<NA>,NaN,<NA>,8369,117246,<NA>,<NA>,NaN,NaN,<NA>
mean,51838.497184,NaN,556004.376639,3.298642,2.518656,13.810222,935370.259344,NaN,NaN,37940.344986,2137.921607,2012-07-21 19:27:48.689547008,2.544226e+02,2012.052136
min,2.0,NaN,1.0,1.0,1.0,0.010000,55.0,NaN,NaN,0.0,4.0,1901-01-01 00:00:00,1.000100e-04,1901.0
25%,24866.0,NaN,210000.0,3.0,2.0,0.150000,467883.0,NaN,NaN,23149.0,1312.0,2006-08-18 00:00:00,1.303957e+02,2006.0
50%,52648.0,NaN,340000.0,3.0,2.0,0.250000,939124.0,NaN,NaN,33852.0,1800.0,2015-10-06 00:00:00,1.826419e+02,2015.0
75%,78552.0,NaN,539000.0,4.0,3.0,0.610000,1398861.0,NaN,NaN,53948.0,2500.0,2019-10-30 00:00:00,2.579216e+02,2019.0
max,110142.0,NaN,2147483600.0,210.0,212.0,100000.000000,2001321.0,NaN,NaN,99999.0,9842382.0,2026-04-08 00:00:00,2.426535e+06,2026.0
std,29985.545813,NaN,3091643.80072,1.431049,1.365941,844.027916,541550.735455,NaN,NaN,19897.544941,12506.028985,NaN,3.036167e+03,9.331784

**I validated data types, removed invalid values, engineered pricing metrics, preserved meaningful nulls, and exported an analysis-ready fact table for Power BI visualization.**

In [30]:
#Checking distinct states
unique_states = sorted(df['state'].unique())
num_unique_states = df['state'].nunique()

unique_states
#num_unique_states

['Alabama',
 'Arkansas',
 'California',
 'Colorado',
 'Connecticut',
 'Delaware',
 'District of Columbia',
 'Florida',
 'Georgia',
 'Idaho',
 'Illinois',
 'Indiana',
 'Iowa',
 'Kansas',
 'Kentucky',
 'Louisiana',
 'Maine',
 'Maryland',
 'Massachusetts',
 'Michigan',
 'Minnesota',
 'Mississippi',
 'Missouri',
 'Montana',
 'Nebraska',
 'New Hampshire',
 'New Jersey',
 'New Mexico',
 'New York',
 'North Carolina',
 'North Dakota',
 'Ohio',
 'Oklahoma',
 'Pennsylvania',
 'Puerto Rico',
 'Rhode Island',
 'South Carolina',
 'South Dakota',
 'Tennessee',
 'Texas',
 'Vermont',
 'Virgin Islands',
 'Virginia',
 'West Virginia',
 'Wisconsin',
 'Wyoming']

In [31]:
df = df.sort_values(["prev_sold_year", "prev_sold_date"], ascending=False)

In [32]:
df.head(5)

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,price_per_sqft,prev_sold_year
394748,52806,for_sale,235000,4,2,0.34,844509,Gainesville,Georgia,30506,1701,2026-04-08,138.154027,2026
998205,82418,for_sale,170000,3,2,NaN,565795,Stillwater,Oklahoma,74075,1796,2024-10-26,94.654788,2024
913638,25434,for_sale,46000,2,2,0.34,907074,Paragould,Arkansas,72450,1216,2024-10-01,37.828947,2024
360718,88236,for_sale,459900,5,4,1.44,1644679,Clarkesville,Georgia,30523,5000,2024-04-17,91.980000,2024
395994,33717,for_sale,409000,4,1,0.54,1027298,Dawsonville,Georgia,30534,3391,2024-03-31,120.613388,2024

In [33]:
df.to_csv(
    "usa_real_estate_cleaned.csv",
    index=False
)